In [9]:
import pandas as pd
import numpy as np
import scipy as sp

In [10]:
d = {'Col 1':[1,2,3,4,7], 'Col 2':[4,5,6,9,5], 'Col 3':[7,8,12,1,11]}
df = pd.DataFrame(data=d)
df

   Col 1  Col 2  Col 3
0      1      4      7
1      2      5      8
2      3      6     12
3      4      9      1
4      7      5     11

In [11]:
count_col=df.shape[1]
count_row=df.shape[0]
print("Number of Column: " + str(count_col))
print("Number of Rows: "+ str(count_row))

Number of Column: 3
Number of Rows: 5

In [12]:
Average_pulse_max=max(80,85,90,95,100,105,110,115,120,125)
Average_pulse_min=min(80,85,90,95,100,105,110,115,120,125)
print(Average_pulse_max)
print(Average_pulse_min)

125
80

In [13]:
Calorie_burnage=[240,250,260,270,280,290,300,310,320,330]
Average_calorie_burnage=np.mean(Calorie_burnage)
print(Average_calorie_burnage)

285.0

In [14]:
df=pd.read_excel("D:\\Downloads\\student.xlsx")
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

In [16]:
df.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000